.config/crafted-emacs/modules/bootstrap-straight.el
;; Example early-init.el for using the straight.el package manager.
;; This does *not* load crafted-early-init-config
;; (which would normally bootstrap package.el).

(setq package-enable-at-startup nil)

(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(setq use-package-always-ensure t)

(provide 'bootstrap-straight)
